Revit 2024 API
VisibleInViewFilter Class
 A quick filter that passes elements that are most likely visible in the given view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public class VisibleInViewFilter : ElementQuickFilter
Visual Basic
Public Class VisibleInViewFilter _
	Inherits ElementQuickFilter
Visual C++
public ref class VisibleInViewFilter : public ElementQuickFilter
Remarks
 This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory. In some situations (for example, when the element geometry is not yet calculated for the input view) this filter may return true even though the element may not actually be visible when geometry is calculated.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementQuickFilter
 Autodesk.Revit.DB.VisibleInViewFilter
See Also
VisibleInViewFilter Members
Autodesk.Revit.DB Namespace